traveler_backend/app/controllers/itineraries_controller.rb

    def set_itinerary
      @itinerary = Itinerary.find(params[:id])
---
SELECT "itineraries".* FROM "itineraries" WHERE "itineraries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]