traveler_backend/app/controllers/itineraries_controller.rb

SELECT "itineraries".* FROM "itineraries" WHERE "itineraries"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_itinerary
      @itinerary = Itinerary.find(params[:id])