traveler_backend/app/controllers/itineraries_controller.rb

  def show
    # @itinerary.users = @itinerary.users.username
    usernames = []
    @itinerary.users.each do |user|
---
SELECT "users".* FROM "users" INNER JOIN "lookups" ON "users"."id" = "lookups"."user_id" WHERE "lookups"."itinerary_id" = $1  [["itinerary_id", 1]]

  def create
    dates = JSON.parse itinerary_params["dates"]
    location = itinerary_params["location"]
    shared = itinerary_params["shared"]

    new_itinerary_params = { "location" => location , "dates" => dates, "shared" => shared }
    itinerary = Itinerary.new(new_itinerary_params)

    if itinerary.save

      100.times do
        planning_row_params = { "itinerary_id" => itinerary.id }
        PlanningRow.create(planning_row_params)
      end

      itinerary.dates.each do |date|
        20.times do
          scheduling_row_params = { "itinerary_id" => itinerary.id, "date" => date}
          SchedulingRow.create(scheduling_row_params)
        end
      end

      lookup_params = {"user_id" => params[:user_id] , "itinerary_id" => itinerary.id }
      lookup = Lookup.new(lookup_params)

      if lookup.save
---
INSERT INTO "itineraries" ("location", "shared", "dates", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
INSERT INTO "planning_rows" ("itinerary_id", "interest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["itinerary_id", 4], ["interest", 0], ["created_at", "2020-02-06 23:58:19.523290"], ["updated_at", "2020-02-06 23:58:19.523290"]]
INSERT INTO "scheduling_rows" ("date", "itinerary_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["date", "02.18.20"], ["itinerary_id", 4], ["created_at", "2020-02-06 23:58:20.030496"], ["updated_at", "2020-02-06 23:58:20.030496"]]
INSERT INTO "lookups" ("user_id", "itinerary_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["itinerary_id", 4], ["created_at", "2020-02-06 23:58:21.131985"], ["updated_at", "2020-02-06 23:58:21.131985"]]

  def update
    dates = JSON.parse itinerary_params["dates"]
    location = itinerary_params["location"]
    shared = itinerary_params["shared"]

    new_itinerary_params = { "location" => location , "dates" => dates, "shared" => shared }

    if @itinerary.update(new_itinerary_params)
---
UPDATE "itineraries" SET "location" = $1, "updated_at" = $2 WHERE "itineraries"."id" = $3  [["location", "123456..."], ["updated_at", "2020-02-08 00:45:55.872441"], ["id", 5]]

    def set_itinerary
      @itinerary = Itinerary.find(params[:id])
---
SELECT "itineraries".* FROM "itineraries" WHERE "itineraries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]