traveler_backend/app/controllers/lookups_controller.rb

  def create

    @user = User.where(username: lookup_params[:username] )

    if @user.empty? == false

      @lookup = Lookup.new(itinerary_id:lookup_params[:itinerary_id], user_id: @user.ids[0])
---
SELECT "lookups".* FROM "lookups"