traveler_backend/app/controllers/planning_rows_controller.rb

SELECT "planning_rows".* FROM "planning_rows"
---
  def index
    @planning_rows = PlanningRow.all