traveler_backend/app/controllers/scheduling_rows_controller.rb

SELECT "scheduling_rows".* FROM "scheduling_rows"
---
  def index
    @scheduling_rows = SchedulingRow.all