traveler_backend/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "test"], ["LIMIT", 1]]
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create

    if !User.find_by(username: params[:username])
      user = User.new(user_params)
    else
      user = nil
    end

    if user != nil && user.save