backend/app/controllers/sessions_controller.rb

    def create
        p "inside sessions controller create"
        @user = User.find_by(username: session_params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "123"], ["LIMIT", 1]]