backend/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "111"], ["password_digest", "$2a$12$/4F0QVyDxJ9IB6puAKyOpueZ1zTrEaMiUqVB.WSHDU8LOisrZ0ITm"], ["created_at", "2020-01-27 00:37:07.402566"], ["updated_at", "2020-01-27 00:37:07.402566"]]
---
  def create
    @user = User.new(user_params)

    if @user.save