backend/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "fff"], ["password_digest", "$2a$12$yvXsmt5CGED8VjPkc8Ft3uWefIIYPRsqEgxK/z9VgS9m6NUE7EQ8q"], ["created_at", "2020-01-28 02:37:59.291535"], ["updated_at", "2020-01-28 02:37:59.291535"]]
---
  def create
    user = User.create(user_params)